In [1]:
import pandas as pd

In [2]:
data=[['Juan',25,'direccion1'],['Maria',21,'direccion2'],['Pedro',20,'direccion3']]
df=pd.DataFrame(data,columns=['Nombre','Edad','Direccion'])

In [3]:
df

  Nombre  Edad   Direccion
0   Juan    25  direccion1
1  Maria    21  direccion2
2  Pedro    20  direccion3

In [4]:
data={
    'Nombre':['Juan','Maria','Pedro'],
    'Edad':[25,35,45]
}
df=pd.DataFrame(data)

In [5]:
#leer csv
df=pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
df=pd.read_csv('./data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [11]:
df=pd.read_csv('./data/data_without_header', header=None,names=['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
df=pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [14]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [17]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [18]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [24]:
data={'Grupo':['A','B','A','B'],
      'Valor':[10,15,20,25]}

df=pd.DataFrame(data)

In [28]:
promedio=df.groupby('Grupo').mean()
promedio

       Valor
Grupo
A       15.0
B       20.0

In [29]:
df['valor_doble']=df['Valor'].apply(lambda x: x*2)

In [30]:
df

  Grupo  Valor  valor_doble
0     A     10           20
1     B     15           30
2     A     20           40
3     B     25           50

In [33]:
df['suma']=df.apply(lambda row: row['Valor']+row['valor_doble'],axis=1)

In [34]:
df

  Grupo  Valor  valor_doble  suma
0     A     10           20    30
1     B     15           30    45
2     A     20           40    60
3     B     25           50    75